package leetcode

import (
	"fmt"
	"strings"
	"testing"
)

func Test_people(t *testing.T) {
	str := "晏东(晏东)\n群主\n陈汶(陈汶)\n何李蒙(何李蒙)\n舒彩屏(舒彩屏)\n沈芫玉(沈芫玉)\n范青松(范青松)\n张李昆(张李昆)\n马辉煌(马辉煌)\n李国席(李国席)\n汪萍(汪萍)\n黄晓梅(黄晓梅)\n廖雪华(廖雪华)\n谢飞宇(谢飞宇)\n田路(田路)\n杨渝(杨渝)\n刘元平(刘元平)\n骆宇平(骆宇平)\n郑伟(郑伟)\n侯光文(侯光文)\n黄荟宇(黄荟宇)\n吕静(吕静)\n付涛(付涛)\n杨兴强(杨兴强)\n李定芳(李定芳)\n陈虹君(陈虹君)\n周华铭(周华铭)\n白俊(白俊)\n王小均(王小均)\n严禄玮(严禄玮)\n韩博(韩博)\n向晴(向晴)\n安露明(安露明)\n徐文翔(徐文翔)\n尉进军(尉进军)\n陈燕(陈燕)\n巫德海(巫德海)\n周铭橙(周铭橙)\n罗加宇(罗加宇)\n韩涛(韩涛)\n骆婷(骆婷)\n李耀宗(李耀宗)\n董佳(董佳)\n杜渤(杜渤)\n余书漫(余书漫)\n兰邦宇(兰邦宇)\n叶盼(叶盼)\n罗娟(罗娟)\n张海英(张海英)\n包鹏举(包鹏举)\n杨涛(杨涛)\n武玉(武玉)\n杨忻远(杨忻远)\n蒋雪梅(蒋雪梅)\n吴晓勇(吴晓勇)\n饶国川(饶国川)\n赵晓珊(赵晓珊)\n谢雨晨(谢雨晨)\n刘柳(刘柳)\n刘振(刘振)\n陈冰洁(陈冰洁)\n曾程(曾程)\n李爽(李爽)\n黎明(黎明)\n王荣毅(王荣毅)\n康浩(康浩)\n杜嘉暄(杜嘉暄)\n魏毅(魏毅)\n杨志(杨志)\n王宇飞(王宇飞)\n余旭潼(余旭潼)\n曾杨阳(曾杨阳)\n杨莹(杨莹)\n罗焕燃(罗焕燃)\n王珺(王珺)\n邓红斌(邓红斌)\n郭康(郭康)\n谢中(谢中)\n宋姚(宋姚)\n罗治港(罗治港)\n彭杰(彭杰)\n任云康(任云康)\n李游(李游)\n陈安辉(陈安辉)\n戚宏成(戚宏成)\n苏志贤(苏志贤)\n张祥明(张祥明)\n张纯熠(张纯熠)\n程嘉丰(程嘉丰)\n张洪银(张洪银)\n郑宇(郑宇)\n李东升(李东升)\n赵敏(赵敏)\n岑鑫(岑鑫)\n李军(李军)\n刘明洋(刘明洋)\n万英哲(万英哲)\n程粤(程粤)\n杨雨松(杨雨松)\n潘云鹏(潘云鹏)\n曾晟(曾晟)\n邱礼胜(邱礼胜)\n刘晓明(刘晓明)\n高媛(高媛)\n肖欣悦(肖欣悦)\n曾会成(曾"
	arr1 := strings.Split(str, "\n")

	str2 := "晏东(晏东)\n群主\n陈汶(陈汶)\n何李蒙(何李蒙)\n舒彩屏(舒彩屏)\n沈芫玉(沈芫玉)\n范青松(范青松)\n张李昆(张李昆)\n马辉煌(马辉煌)\n李国席(李国席)\n汪萍(汪萍)\n黄晓梅(黄晓梅)\n廖雪华(廖雪华)\n谢飞宇(谢飞宇)\n田路(田路)\n杨渝(杨渝)\n刘元平(刘元平)\n骆宇平(骆宇平)\n郑伟(郑伟)\n侯光文(侯光文)\n黄荟宇(黄荟宇)\n吕静(吕静)\n付涛(付涛)\n杨兴强(杨兴强)\n李定芳(李定芳)\n陈虹君(陈虹君)\n周华铭(周华铭)\n白俊(白俊)\n王小均(王小均)\n严禄玮(严禄玮)\n韩博(韩博)\n向晴(向晴)\n安露明(安露明)\n徐文翔(徐文翔)\n尉进军(尉进军)\n陈燕(陈燕)\n巫德海(巫德海)\n周铭橙(周铭橙)\n罗加宇(罗加宇)\n韩涛(韩涛)\n骆婷(骆婷)\n李耀宗(李耀宗)\n董佳(董佳)\n杜渤(杜渤)\n余书漫(余书漫)\n兰邦宇(兰邦宇)\n叶盼(叶盼)\n罗娟(罗娟)\n张海英(张海英)\n包鹏举(包鹏举)\n杨涛(杨涛)\n武玉(武玉)\n杨忻远(杨忻远)\n蒋雪梅(蒋雪梅)\n吴晓勇(吴晓勇)\n饶国川(饶国川)\n赵晓珊(赵晓珊)\n谢雨晨(谢雨晨)\n刘柳(刘柳)\n刘振(刘振)\n陈冰洁(陈冰洁)\n曾程(曾程)\n李爽(李爽)\n黎明(黎明)\n王荣毅(王荣毅)\n康浩(康浩)\n杜嘉暄(杜嘉暄)\n魏毅(魏毅)\n杨志(杨志)\n王宇飞(王宇飞)\n余旭潼(余旭潼)\n曾杨阳(曾杨阳)\n杨莹(杨莹)\n罗焕燃(罗焕燃)\n王珺(王珺)\n邓红斌(邓红斌)\n郭康(郭康)\n谢中(谢中)\n宋姚(宋姚)\n罗治港(罗治港)\n彭杰(彭杰)\n任云康(任云康)\n李游(李游)\n陈安辉(陈安辉)\n戚宏成(戚宏成)\n苏志贤(苏志贤)\n张祥明(张祥明)\n张纯熠(张纯熠)\n程嘉丰(程嘉丰)\n张洪银(张洪银)\n郑宇(郑宇)\n李东升(李东升)\n赵敏(赵敏)\n岑鑫(岑鑫)\n李军(李军)\n刘明洋(刘明洋)\n万英哲(万英哲)\n杨雨松(杨雨松)\n潘云鹏(潘云鹏)\n曾晟(曾晟)\n邱礼胜(邱礼胜)\n刘晓明(刘晓明)\n高媛(高媛)\n肖欣悦(肖欣悦)\n曾会成(曾"
	arr2 := strings.Split(str2, "\n")

	x := make(map[string]bool, 0)
	for i, _ := range arr1 {
		old := arr1[i]
		x[old] = false
	}

	y := make(map[string]string, 0)
	for j, _ := range arr2 {
		new := arr2[j]
		if _, ok := x[new]; ok {
			x[new] = true
			continue
		} else {
			y[new] = new
		}
	}

	for _, v := range y {
		fmt.Printf("离职：%s", v)
	}
	for k, v := range x {
		if v == false {
			fmt.Printf("离职: %s", k)
		}
	}
}
